import utils from '../../src/hdmap/utils.js';

describe('根据三个GPS点进行中心点计算', () => {
  it('测试点与中心点相同', () => {
    expect([113.62344847207214, 23.301067275209203]).to.deep.equal(
      utils.getCenterGPS(
        {
          lonlatA: [113.623583, 23.301617],
          lonlatB: [113.624305, 23.300673],
          lonlatC: [113.622706, 23.299229]
        },
        {
          pointA: [11.328125, 49.60937499999994],
          pointB: [69.140625, -35.54687500000006],
          pointC: [-61.328125, -164.45312500000006]
        }
      )
    );
  });
  it('测试点与中心点不同', () => {
    expect([13.6234, 123.30106]).to.not.deep.equal(
      utils.getCenterGPS(
        {
          lonlatA: [113.623583, 23.301617],
          lonlatB: [113.624305, 23.300673],
          lonlatC: [113.622706, 23.299229]
        },
        {
          pointA: [11.328125, 49.60937499999994],
          pointB: [69.140625, -35.54687500000006],
          pointC: [-61.328125, -164.45312500000006]
        }
      )
    );
  });
});
